УТ_для_edt.РасширениеСмарт/src/Documents/ТаможеннаяДекларацияИмпорт/ТаможеннаяДекларацияИмпорт.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ТаможеннаяДекларацияИмпорт</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes>
    <name>Груз</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ГруппаФинансовогоУчета</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ПорядокРасчетов</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>АналитикаРасходовСбор</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>СтатьяРасходовСбор</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>БанковскийСчетКонтрагента</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>НаправлениеДеятельности</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ТаможенныйШтраф</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Поставщик</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>КонтрагентПоставщика</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Статус</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>НомерДекларации</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ВариантОформления</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Партнер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Соглашение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Договор</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ТаможенныйСбор</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>СтатьяРасходовШтраф</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>АналитикаРасходовШтраф</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Менеджер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДатаПлатежа</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ФормаОплаты</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ВалютаВзаиморасчетов</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ПорядокОплаты</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>УдалитьАналитикаУчетаПартий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>БанковскийСчетОрганизации</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="9145a807-cbae-41d4-a776-54fe12a14c2b">
    <name>ОплатаЧерезЕдиныйЛицевойСчет</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections>
    <name>Разделы</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>ТаможеннаяСтоимость</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Склад</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>СтранаПроисхождения</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>НомерРаздела</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>3</precision>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>СтавкаПошлины</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>6</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>СуммаПошлины</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Товары</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>Серия</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>НомерРаздела</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>3</precision>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>КоличествоУпаковок</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>СуммаПошлины</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ТаможеннаяСтоимость</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>СтранаПроисхождения</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>НомерДляСФ</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>30</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>НомерГТД</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Склад</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ДокументПоступления</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ВидЗапасов</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>УдалитьАналитикаУчетаПартий</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="fbafd281-49af-43bc-9d61-76744f0ed657">
      <name>ЗакупкаПодДеятельность</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="04d1c7f5-e019-4df2-897c-97a28ee6575e">
      <name>КоличествоПоРНПТ</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>23</precision>
            <scale>11</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
</mdclass:Document>

УТ_для_edt.РасширениеСмарт/src/Enums/СтатусыГрузов/СтатусыГрузов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>СтатусыГрузов</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues>
    <name>ВПути</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>Принят</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

УТ_для_edt.РасширениеСмарт/src/Enums/ПорядокРасчетов/ПорядокРасчетов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ПорядокРасчетов</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues>
    <name>ПоДоговорамКонтрагентов</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ПоЗаказамНакладным</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ПоНакладным</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

УТ_для_edt.РасширениеСмарт/src/Enums/ПорядокОплатыПоСоглашениям/ПорядокОплатыПоСоглашениям.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ПорядокОплатыПоСоглашениям</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues>
    <name>РасчетыВРубляхОплатаВРублях</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>РасчетыВВалютеОплатаВРублях</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>РасчетыВВалютеОплатаВВалюте</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>РасчетыВРубляхОплатаВВалюте</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

УТ_для_edt.РасширениеСмарт/src/Enums/ФормыОплаты/ФормыОплаты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ФормыОплаты</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues>
    <name>Наличная</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>Безналичная</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ПлатежнаяКарта</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

УТ_для_edt.РасширениеСмарт/src/Enums/СтавкиНДС/СтавкиНДС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>СтавкиНДС</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues>
    <name>БезНДС</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>НДС10</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>НДС18</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>НДС0</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>НДС20</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

УТ_для_edt.РасширениеСмарт/src/Enums/СтатусыДоговоровКонтрагентов/СтатусыДоговоровКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>СтатусыДоговоровКонтрагентов</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues>
    <name>Действует</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

УТ_для_edt.РасширениеСмарт/src/Documents/ТаможеннаяДекларацияИмпорт/Forms/ФормаДокумента/Module.bsl
#Область ПеренесеноСДоработками

// Фролов+
&НаСервере
Процедура смарт_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	//++ #6094 смарт: Тимофеева 17.03.26 / Документ "Предварительная таможенная декларация". Доработки заполнения и гарантии
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) И НЕ ЗначениеЗаполнено(Объект.смартПредварительнаяТаможеннаяДекларацияИмпорт) Тогда 	
		Если ЗначениеЗаполнено(Объект.Подразделение) И НЕ ЗначениеЗаполнено(Объект.Организация) Тогда
			Объект.Организация = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Подразделение, "смартОрганизацияВладелец");
			ОрганизацияПриИзмененииСервер();
		КонецЕсли;
		Объект.ВариантОформления = Перечисления.ХозяйственныеОперации.ОформлениеГТДСамостоятельно;
		Объект.Контрагент = Справочники.смартПредопределенныеЗначения.КонтрагентПоУмолчаниюДляТаможеннойДекларации.Значение;
		Если ЗначениеЗаполнено(Объект.Контрагент) Тогда 
			Объект.Партнер 	= ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Контрагент, "Партнер"); 
			ЗаполнитьДоговорПоУмолчанию();
			Объект.БанковскийСчетКонтрагента = ЗначениеНастроекПовтИсп.ПолучитьБанковскийСчетКонтрагентаПоУмолчанию(Объект.Контрагент, , Объект.БанковскийСчетКонтрагента);
			
			ЗаполнитьДанныеФормы(Истина);
			НастроитьЭлементыФормы();
			ОчиститьРасшифровкуПлатежа();
		КонецЕсли; 
		
		//++ #6934 смарт: Тимофеева 28.05.2026 / Доработать загрузку ПТД и ТД
		Объект.СтатьяРасходовСбор 	= Справочники.смартПредопределенныеЗначения.СтатьяРасходовПоСборамПоУмолчаниюДляТаможеннойДекларации.Значение;
		СтатьяРасходовПриИзмененииНаСервере("Сбор");
		Объект.ДатаПлатежа 			= ТекущаяДатаСеанса();
		//-- #6934 смарт: Тимофеева 28.05.2026
	КонецЕсли;
	//-- #6094 смарт: Тимофеева 17.03.26

	ДоступностьЭлементаГруз();
	ДобавитьЭлементыПрограммно();
	
КонецПроцедуры

//++ #Б-972 смарт: Лопато 01.10.2024 //Рефакторинг кода 1С. База УТ СМАРТ. Документы. ТаможеннаяДекларацияИмпорт  
&НаКлиенте
&ИзменениеИКонтроль("ПодобратьИзПоступленийЗавершение")
Процедура смарт_ПодобратьИзПоступленийЗавершение(Результат, ДополнительныеПараметры)

	ДанныеРаздела = ДанныеТекущегоРаздела(Элементы.Разделы);

	ПараметрыПодбора = Новый Структура;
	ПараметрыПодбора.Вставить("Партнер",          Объект.Поставщик);
	ПараметрыПодбора.Вставить("Организация",      Объект.Организация);
	ПараметрыПодбора.Вставить("Склад",            ДанныеРаздела.Склад);
	ПараметрыПодбора.Вставить("ЗакупкаПоИмпорту", Истина);
	ПараметрыПодбора.Вставить("ПоказыватьТару",   Ложь);
	ПараметрыПодбора.Вставить("ПоказыватьТовары", Истина);
	ПараметрыПодбора.Вставить("ЦенаВключаетНДС",  Ложь);
	ПараметрыПодбора.Вставить("Валюта",           Объект.Валюта);
	ПараметрыПодбора.Вставить("Дата",             ДатаДокумента(Объект.Дата));

	#Вставка //#Б-972 смарт: Лопато 01.10.2024 //Рефакторинг кода 1С. База УТ СМАРТ. Документы. ТаможеннаяДекларацияИмпорт
	//++ смарт:ММ #042 222 27.03.2020 Рефакторинг. Перенесено из расширения (отмена &Вместо) 
	// Фролов+
	Если ЗначениеЗаполнено(Объект.Груз) Тогда 
		ПараметрыПодбора.Вставить("Груз", Объект.Груз);  
	КонецЕсли;	
	// Фролов-
	//-- смарт:ММ 27.03.2020

	//++ Смарт:  Демичев №1022 09.08.2022 ((Укажем, что форму вызываем из Таможенной декларации, чтобы не сворачивать строки только для нее
	ПараметрыПодбора.Вставить("Смарт_ТаможеннаяДекларация", Истина);  	
	//-- Смарт:  Демичев №1022 09.08.2022 
	#КонецВставки

	ОткрытьФорму("ОбщаяФорма.ПодборТоваровПоПоступлениям", ПараметрыПодбора, ЭтаФорма);

	ОбновитьИнформациюПоПоступлениям();

КонецПроцедуры

//++ #Б-972 смарт: Лопато 01.10.2024 //Рефакторинг кода 1С. База УТ СМАРТ. Документы. ТаможеннаяДекларацияИмпорт  
&НаСервере
&ИзменениеИКонтроль("РаспределитьНаТоварыСервер")
Процедура смарт_РаспределитьНаТоварыСервер()
	Отбор = Новый Структура("НомерРаздела");
	Разделы = ОбщегоНазначенияУТКлиентСервер.ВыделенныеЭлементыКоллекции(Объект.Разделы, Элементы.Разделы.ВыделенныеСтроки);
	Для Каждого Раздел Из Разделы Цикл
		Отбор.НомерРаздела = Раздел.НомерРаздела;
		ТоварыРаздела = Объект.Товары.Выгрузить(Отбор);
		
		Если ТоварыРаздела.Количество() > 0 Тогда
			Коэффициенты = ТоварыРаздела.ВыгрузитьКолонку("ТаможеннаяСтоимость");
			НовыеСуммы = ОбщегоНазначения.РаспределитьСуммуПропорциональноКоэффициентам(Раздел.ТаможеннаяСтоимость, Коэффициенты);
			Если НовыеСуммы <> Неопределено Тогда
				ТоварыРаздела.ЗагрузитьКолонку(НовыеСуммы, "ТаможеннаяСтоимость");
			КонецЕсли;
			НовыеСуммы = ОбщегоНазначения.РаспределитьСуммуПропорциональноКоэффициентам(Раздел.СуммаПошлины, Коэффициенты);
			Если НовыеСуммы <> Неопределено Тогда
				ТоварыРаздела.ЗагрузитьКолонку(НовыеСуммы, "СуммаПошлины");
			КонецЕсли;
			НовыеСуммы = ОбщегоНазначения.РаспределитьСуммуПропорциональноКоэффициентам(Раздел.СуммаНДС, Коэффициенты);
			Если НовыеСуммы <> Неопределено Тогда
				ТоварыРаздела.ЗагрузитьКолонку(НовыеСуммы, "СуммаНДС");
			КонецЕсли;
		КонецЕсли;
		
		Для каждого Товар Из ТоварыРаздела Цикл
			ОбъектТовар = Объект.Товары[Товар.НомерСтроки-1];
			Объект.Товары[Товар.НомерСтроки-1].ТаможеннаяСтоимость = ?(Раздел.ТаможеннаяСтоимость > 0., Товар.ТаможеннаяСтоимость, 0.);
			Объект.Товары[Товар.НомерСтроки-1].СуммаПошлины = ?(Раздел.СуммаПошлины > 0., Товар.СуммаПошлины, 0.);
			Объект.Товары[Товар.НомерСтроки-1].СуммаНДС = ?(Раздел.СуммаНДС > 0., Товар.СуммаНДС, 0.);

			#Вставка //#Б-972 смарт: Лопато 01.10.2024 //Рефакторинг кода 1С. База УТ СМАРТ. Документы. ТаможеннаяДекларацияИмпорт
			//++ смарт:ММ #042 222 27.03.2020 Рефакторинг. Перенесено из расширения (отмена &Вместо) 
			// Фролов+
			Объект.Товары[Товар.НомерСтроки-1].СтранаПроисхождения = Раздел.СтранаПроисхождения;
			// Фролов-
			//-- смарт:ММ 27.03.2020
			#КонецВставки
			
		КонецЦикла;
	КонецЦикла;
		
	ЗаполнитьЗначенияСвойств(ЭтаФорма, РазностиИтогов(Объект.Разделы, Объект.Товары));
КонецПроцедуры

#КонецОбласти

#Область ДоработкиСмарт

// Фролов+
&НаСервере
Процедура ДоступностьЭлементаГруз()
	Элементы.ДекорацияГруз.Заголовок=Объект.Груз.СтатусГруза;
	Если Объект.Груз.СтатусГруза=ПредопределенноеЗначение("Перечисление.СтатусыГрузов.Принят") Тогда 
		Элементы.Груз.ТолькоПросмотр=Не РольДоступна("ПолныеПрава");
		Элементы.ДекорацияГруз.ЦветТекста=WebЦвета.Зеленый;
	Иначе
		Элементы.ДекорацияГруз.ЦветТекста=WebЦвета.ТемноОранжевый;
	КонецЕсли;	
КонецПроцедуры	

&НаКлиенте
Процедура смарт_РазделыПеретаскиваниеВместо(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	СтандартнаяОбработка=Ложь;
	Если ТипЗнч(ПараметрыПеретаскивания.Значение)=Тип("Массив") Тогда 
		Для Каждого Стр Из ПараметрыПеретаскивания.Значение Цикл 
			Стр.НомерРаздела=Объект.Разделы.НайтиПоИдентификатору(Строка).НомерРаздела;
		КонецЦикла;
		Элемент.ВыделенныеСтроки.Добавить(Строка);
		РаспределитьНаТоварыСервер();
		Элемент.ВыделенныеСтроки.Удалить(Элемент.ВыделенныеСтроки.Найти(Строка));
		Модифицированность=Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура смартЗаполнитьПоГрузу(Команда)
	Если Не ЗначениеЗаполнено(Объект.Груз) Тогда 
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Поле 'Груз' не заполнено.",,"Объект.Груз");
		Возврат;
	КонецЕсли;	
	Если Объект.Товары.Количество() Тогда
		ТекстВопроса="Табличные части будут очищены!
						|Продолжить?";
		ПоказатьВопрос(Новый ОписаниеОповещения("ПослеВопросаЗагрузитьПоГрузу",ЭтотОбъект),ТекстВопроса,РежимДиалогаВопрос.ДаНет);
	Иначе 
		ЗаполнитьПоГрузуНаСервере();
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВопросаЗагрузитьПоГрузу(Рез,ДопПараметры)Экспорт 
	Если Рез=КодВозвратаДиалога.Да Тогда 
		ЗаполнитьПоГрузуНаСервере();
	КонецЕсли;	
КонецПроцедуры	

&НаСервере
Процедура ЗаполнитьПоГрузуНаСервере()
	Объект.Разделы.Очистить();
	Объект.Товары.Очистить();
	Элементы.ТоварыНомерРаздела.СписокВыбора.Очистить();
	Элементы.ТоварыНомерРаздела.СписокВыбора.Добавить(0,"-");
	
	Запрос=Новый Запрос;
	Запрос.УстановитьПараметр("Груз",Объект.Груз);
	Запрос.Текст="ВЫБРАТЬ
	             |	ПриобретениеТоваровУслугТовары.Номенклатура.КодТНВЭД КАК КодТНВЭД,
	             |	ПриобретениеТоваровУслугТовары.Ссылка КАК ДокументПоступления,
	             |	ПриобретениеТоваровУслугТовары.Номенклатура КАК Номенклатура,
	             |	ПриобретениеТоваровУслугТовары.Характеристика КАК Характеристика,
	             |	ПриобретениеТоваровУслугТовары.Серия КАК Серия,
	             |	ПриобретениеТоваровУслугТовары.Номенклатура.СтранаПроисхождения КАК СтранаПроисхождения,
	             |	ПриобретениеТоваровУслугТовары.Упаковка КАК Упаковка,
	             |	ПриобретениеТоваровУслугТовары.КоличествоУпаковок КАК КоличествоУпаковок,
	             |	ЕСТЬNULL(ПриобретениеТоваровУслугТовары.Склад, ПриобретениеТоваровУслугТовары.Ссылка.Склад) КАК Склад
	             |ИЗ
	             |	Документ.ПриобретениеТоваровУслуг.Товары КАК ПриобретениеТоваровУслугТовары
	             |ГДЕ
	             |	ПриобретениеТоваровУслугТовары.Ссылка.Груз = &Груз
	             |ИТОГИ ПО
	             |	КодТНВЭД,Склад,СтранаПроисхождения";
	КодыТНВЭД=Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	НомерРаздела=1;
	Пока КодыТНВЭД.Следующий() Цикл 
		Склады=КодыТНВЭД.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Пока Склады.Следующий() Цикл
			Страны=Склады.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			
			Пока Страны.Следующий() Цикл 
				Раздел=Объект.Разделы.Добавить();
				Раздел.СтранаПроисхождения=Страны.СтранаПроисхождения;
				Раздел.Склад=Склады.Склад;
				Раздел.НомерРаздела=НомерРаздела;
				
				Данные=Страны.Выбрать();
				Пока Данные.Следующий() Цикл 
					Стр=Объект.Товары.Добавить();
					ЗаполнитьЗначенияСвойств(Стр,Данные);
					Стр.НомерРаздела=НомерРаздела;
					ПересчитатьСтрокуПослеЗаполненияИзГруза(Стр);
				КонецЦикла;
				Элементы.ТоварыНомерРаздела.СписокВыбора.Добавить(НомерРаздела,Формат(НомерРаздела,"ЧГ="));
				НомерРаздела=НомерРаздела+1;

				смартЗаполнитьНомерДляСФ(Раздел);
			КонецЦикла;	
		КонецЦикла;	
	КонецЦикла;
	ЗаполнитьЗначенияСвойств(ЭтаФорма, РазностиИтогов(Объект.Разделы, Объект.Товары));
КонецПроцедуры

&НаСервере
Процедура смартЗаполнитьНомерДляСФ(ТекущийРаздел)
	//Табчасть = ?(Объект.НумероватьПоТоварам, Объект.Товары, Объект.Разделы);//rnp закомментировано 10052021, т.к. в релизе 13.47 удален реквизит Нумеровать по товарам
	Табчасть = Объект.Товары;
	//ИмяПоляДополнения = ?(Объект.НумероватьПоТоварам, "НомерСтроки",  "НомерРаздела");//rnp закомментировано 10052021, т.к. в релизе 13.47 удален реквизит Нумеровать по товарам
	ИмяПоляДополнения = "НомерСтроки";
	НомерДекларации = СокрЛП(Объект.НомерДекларации);
	Для Каждого Строка Из Табчасть Цикл
		Строка.НомерДляСФ = НомерДляСФ(НомерДекларации, Строка[ИмяПоляДополнения]);
	КонецЦикла;
	// изменились номера для с/ф - очистим ссылки на номера ГТД
	//ОтборТоваров = ?(Объект.НумероватьПоТоварам, Новый Структура("НомерРаздела", ТекущийРаздел), Новый Структура); /rnp закомментировано 10052021, т.к. в релизе 13.47 удален реквизит Нумеровать по товарам
	ОтборТоваров = Новый Структура("НомерРаздела", ТекущийРаздел);
	ЗаполнитьПоляТабчасти("Товары", Новый Структура("НомерГТД", Неопределено), ОтборТоваров);
КонецПроцедуры

&НаСервере
Процедура ПересчитатьСтрокуПослеЗаполненияИзГруза(Стр)
	Действия = Новый Структура;

	Действия.Вставить("ПроверитьХарактеристикуПоВладельцу", Стр.Характеристика);
	Действия.Вставить("ПроверитьЗаполнитьУпаковкуПоВладельцу", Стр.Упаковка);
	Действия.Вставить("ПересчитатьКоличествоЕдиниц");
	Действия.Вставить("ЗаполнитьПризнакАртикул", Новый Структура("Номенклатура", "Артикул"));
	Действия.Вставить("ЗаполнитьПризнакТипНоменклатуры", Новый Структура("Номенклатура", "ТипНоменклатуры"));
	Действия.Вставить("ПроверитьСериюРассчитатьСтатус", Новый Структура("Склад, ПараметрыУказанияСерий", Стр.Склад, ПараметрыУказанияСерий));

	Действия.Вставить("НоменклатураПриИзмененииПереопределяемый", Новый Структура("ИмяФормы, ИмяТабличнойЧасти",
		ЭтаФорма.ИмяФормы, "Товары"));

	ОбработкаТабличнойЧастиСервер.ОбработатьСтрокуТЧ(Стр, Действия, Неопределено);
КонецПроцедуры	

&НаКлиенте
Процедура смарт_РазделыПослеУдаленияПосле(Элемент)
	УпорядочитьНомераРазделовПослеУдаления(КешРазделов);
КонецПроцедуры

&НаСервере
Процедура УпорядочитьНомераРазделовПослеУдаления(КешРазделов)
	Если Не КешРазделов.Количество() Тогда 
		Возврат;
	КонецЕсли;

	Элементы.ТоварыНомерРаздела.СписокВыбора.Очистить();
	Элементы.ТоварыНомерРаздела.СписокВыбора.Добавить(0,"-");
	
	Для с=0 По Объект.Разделы.Количество()-1 Цикл
		Раздел=Объект.Разделы[с];
		Если Не Раздел.НомерРаздела=с+1 Тогда 		
			МассивСтрокТоваров=Объект.Товары.НайтиСтроки(Новый Структура("НомерРаздела",Раздел.НомерРаздела));
			Для Каждого Стр Из МассивСтрокТоваров Цикл 
				Стр.НомерРаздела=с+1;
			КонецЦикла;	
			Раздел.НомерРаздела=с+1;
			смартЗаполнитьНомерДляСФ(Раздел);
		КонецЕсли;
		Элементы.ТоварыНомерРаздела.СписокВыбора.Добавить(Раздел.НомерРаздела,Формат(Раздел.НомерРаздела,"ЧГ="));
	КонецЦикла;	
КонецПроцедуры

Процедура ДобавитьЭлементыПрограммно()
	
	//++ смарт:rnp 221 19.07.2021
	смартЗапчастиГарантийные = Элементы.Вставить("смартЗапчастиГарантийные", Тип("ПолеФормы"), Элементы.СтраницаОсновное, Элементы.Комментарий);
	смартЗапчастиГарантийные.Вид = ВидПоляФормы.ПолеФлажка;
	смартЗапчастиГарантийные.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Лево;
	смартЗапчастиГарантийные.ПутьКДанным = "Объект.смартЗапчастиГарантийные";
	смартЗапчастиГарантийные.Заголовок = "Запчасти гарантийные (смарт)";
	//-- смарт:rnp 19.07.2021
	
	//++ #Б1598 смарт: Шляпников 09.12.2024 / Раздельный учет товаров. Гарантийные запчасти. Дополнение.
	Если НЕ РольДоступна("ПолныеПрава") Тогда
		смартЗапчастиГарантийные.ТолькоПросмотр = Истина;
	КонецЕсли;
	//-- #Б1598 смарт: Шляпников 09.12.2024
	
КонецПроцедуры 

#КонецОбласти

#Область ДоработкиАвтомакон

&НаСервере
Процедура смарт_ЗаполнитьПоXMLПослеНаСервере(ДвоичныеДанные, СтрокаОшибки)
	//++ смарт:ЩукинВВ #27806 623 17.09.2021
	ФайлШаблона = ПолучитьИмяВременногоФайла("xml");		
	
	ДвоичныеДанные.Записать(ФайлШаблона);
	ПараметрыЧтенияXML = Новый ПараметрыЧтенияXML(,,,,,,,Ложь);
	ЧтениеXML = Новый ЧтениеXML;
	ЧтениеXML.ОткрытьФайл(ФайлШаблона, ПараметрыЧтенияXML);
	
	ОсновнойРаздел = Новый Соответствие;
	РазделРасчеты = Новый Соответствие;
	
	РазделыГТД = Объект.Разделы.Выгрузить();
	РазделыГТД.Очистить();
	
	ТаблицаАртикулов = Новый ТаблицаЗначений;
	ТаблицаАртикулов.Колонки.Добавить("Артикул");
	ТаблицаАртикулов.Колонки.Добавить("НомерРаздела");
	
	СтекИмен = Новый СписокЗначений;
	НомерРаздела = 0;
	Номер = "";
	
	Пока ЧтениеXML.Прочитать() Цикл
		
		Если ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда 
			
			Если ЧтениеXML.Имя = "ContainerDoc" Тогда 
				
				НомерРаздела = НомерРаздела + 1;
				
			КонецЕсли;	
			
			СтекИмен.Добавить(ЧтениеXML.Имя);
			ПутьКСтроке = смарт_ПостроитьПуть(СтекИмен);
			
		ИначеЕсли ЧтениеXML.ТипУзла = ТипУзлаXML.Текст Тогда
			
			ИскомоеЗначение = смарт_ПолучитьЗначениеСоответствия(ОсновнойРаздел,ПутьКСтроке);
			
			Если СтрНайти(ПутьКСтроке, "EECEDocHeaderAddInfo/RUScat_ru:EDocDateTime") <> 0 Тогда 
				
				ДатаСтрокой = СтрЗаменить(ЧтениеXML.Значение, "-","");
				ДатаСтрокой = СтрЗаменить(ДатаСтрокой, ":","");
				ДатаСтрокой = СтрЗаменить(ДатаСтрокой, "T","");
				ПозицияСтрокиПоиска = СтрНайти(ДатаСтрокой, "+");
				Если ПозицияСтрокиПоиска <> 0 Тогда 
					ДатаСтрокой = Лев(ДатаСтрокой, ПозицияСтрокиПоиска-1);
				КонецЕсли;	
				ОсновнойРаздел.Вставить("Дата", Дата(ДатаСтрокой));
				
			ИначеЕсли СтрНайти(ПутьКСтроке, "ESADout_CUConsignor/cat_ru:OrganizationName") <> 0 Тогда 
				
				Контрагент = смарт_ПолучитьКонтрагента(ЧтениеXML.Значение);
				
				Если Контрагент <> Справочники.Контрагенты.ПустаяСсылка() Тогда 
					ОсновнойРаздел.Вставить("КонтрагентПоставщика", Контрагент);
					Поставщик = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Контрагент, "Партнер");
					Если ЗначениеЗаполнено(Поставщик) Тогда 
						ОсновнойРаздел.Вставить("Поставщик", Поставщик);
					КонецЕсли;
				Иначе	
					ОсновнойРаздел.Вставить("КонтрагентПоставщика", Неопределено);
					ОсновнойРаздел.Вставить("Поставщик", Неопределено);
				КонецЕсли;
				
			ИначеЕсли СтрНайти(ПутьКСтроке, "ESADout_CUDeclarant/cat_ru:RFOrganizationFeatures/cat_ru:INN") <> 0 Тогда 
				
				Организация = Справочники.Организации.НайтиПоРеквизиту("ИНН", ЧтениеXML.Значение);
				Если Организация <> Справочники.Организации.ПустаяСсылка() Тогда 
					ОсновнойРаздел.Вставить("Организация", Организация);
				Иначе
					ОсновнойРаздел.Вставить("Организация", Неопределено);
				КонецЕсли;
				
			ИначеЕсли СтрНайти(ПутьКСтроке, "ESADout_CUCustomsPaymentCalculation/catESAD_cu:PaymentModeCode") <> 0 Тогда
				
				ЗаполнитьТаможенныйСбор = Ложь;
				ЗаполнитьСтавкуСуммуПошлины = Ложь;
				ЗаполнитьСтавкуСуммуНДС = Ложь;
				
				Если ЧтениеXML.Значение = "1010" Тогда 
					ЗаполнитьТаможенныйСбор = Истина;
				КонецЕсли;
				
				Если ЧтениеXML.Значение = "2010" Тогда 
					ЗаполнитьСтавкуСуммуПошлины = Истина;
				КонецЕсли;
				
				Если ЧтениеXML.Значение = "5010" Тогда 
					ЗаполнитьСтавкуСуммуНДС = Истина;
				КонецЕсли;
				
			ИначеЕсли СтрНайти(ПутьКСтроке, "ESADout_CUGoods/catESAD_cu:GoodsNumeric") Тогда 
				
				НомерРазделаГТД = Число(ЧтениеXML.Значение); 
				смарт_ЗаполнитьРазделыГТД(НомерРазделаГТД, "НомерРаздела", Число(ЧтениеXML.Значение), РазделыГТД);	
				
			ИначеЕсли СтрНайти(ПутьКСтроке, "ESADout_CUCustomsPaymentCalculation/catESAD_cu:PaymentAmount") <> 0 И ЗаполнитьТаможенныйСбор И НомерРаздела = 1 Тогда 	
				
				РазделРасчеты.Вставить("ТаможенныйСбор", Число(ЧтениеXML.Значение));
				
			ИначеЕсли СтрНайти(ПутьКСтроке, "ESADout_CUCustomsPaymentCalculation/catESAD_cu:PaymentAmount") <> 0 И ЗаполнитьСтавкуСуммуПошлины Тогда 	
				
				смарт_ЗаполнитьРазделыГТД(НомерРазделаГТД, "СуммаПошлины", Число(ЧтениеXML.Значение), РазделыГТД);	
				
			ИначеЕсли ПутьКСтроке = "/ED_Container/ContainerDoc/DocBody/ESADout_CU/ESADout_CUGoodsShipment/ESADout_CUGoods/ESADout_CUCustomsPaymentCalculation/catESAD_cu:Rate" И ЗаполнитьСтавкуСуммуПошлины Тогда 	
				
				смарт_ЗаполнитьРазделыГТД(НомерРазделаГТД, "СтавкаПошлины", Число(ЧтениеXML.Значение), РазделыГТД);
				
			ИначеЕсли СтрНайти(ПутьКСтроке, "ESADout_CUCustomsPaymentCalculation/catESAD_cu:PaymentAmount") <> 0 И ЗаполнитьСтавкуСуммуНДС Тогда 	
				
				смарт_ЗаполнитьРазделыГТД(НомерРазделаГТД, "СуммаНДС", Число(ЧтениеXML.Значение), РазделыГТД);	
				
			ИначеЕсли ПутьКСтроке = "/ED_Container/ContainerDoc/DocBody/ESADout_CU/ESADout_CUGoodsShipment/ESADout_CUGoods/ESADout_CUCustomsPaymentCalculation/catESAD_cu:Rate" И ЗаполнитьСтавкуСуммуНДС Тогда 	
				
				СтавкаНДС = смарт_ПолучитьСтавкуНДС_ПеречислениемСсылка(Число(ЧтениеXML.Значение));
				смарт_ЗаполнитьРазделыГТД(НомерРазделаГТД, "СтавкаНДС", СтавкаНДС, РазделыГТД);	
				
			ИначеЕсли СтрНайти(ПутьКСтроке, "ESADout_CUGoods/catESAD_cu:OriginCountryCode") Тогда
				
				Страна = Справочники.СтраныМира.НайтиПоРеквизиту("КодАльфа2", ЧтениеXML.Значение);
				
				Если Страна = Справочники.СтраныМира.ПустаяСсылка() Тогда 
					Страна = Справочники.СтраныМира.НайтиПоРеквизиту("КодАльфа3", ЧтениеXML.Значение);
				КонецЕсли;
				
				Если Страна <> Справочники.СтраныМира.ПустаяСсылка() Тогда 
					смарт_ЗаполнитьРазделыГТД(НомерРазделаГТД, "СтранаПроисхождения", Страна, РазделыГТД);
				КонецЕсли;
				
			ИначеЕсли ПутьКСтроке = "/ED_Container/ContainerDoc/DocBody/ESADout_CU/ESADout_CUGoodsShipment/ESADout_CUGoods/catESAD_cu:CustomsCost" Тогда
				
				смарт_ЗаполнитьРазделыГТД(НомерРазделаГТД, "ТаможеннаяСтоимость", Число(ЧтениеXML.Значение), РазделыГТД);
				
			ИначеЕсли СтрНайти(ПутьКСтроке, "catESAD_cu:GoodsGroupInformation/catESAD_cu:GoodsMarking") <> 0 И НомерРаздела = 1 Тогда
				
				НоваяСтрока = ТаблицаАртикулов.Добавить();	
				НоваяСтрока.Артикул = ЧтениеXML.Значение;
				НоваяСтрока.НомерРаздела = НомерРазделаГТД;
				
			КонецЕсли;				
			
		ИначеЕсли ЧтениеXML.ТипУзла = ТипУзлаXML.КонецЭлемента Тогда	
			
			СтекИмен.Удалить(СтекИмен.Количество() - 1);
		ИначеЕсли ЧтениеXML.ТипУзла = ТипУзлаXML.Комментарий Тогда 
			
			Если СтрНайти(ЧтениеXML.Значение, "ND") <> 0 Тогда 
				НомерНачальногоСимвола = СтрНайти(ЧтениеXML.Значение, "=")+1;
				НомерДляПоиска = Сред(ЧтениеXML.Значение,НомерНачальногоСимвола, СтрДлина(ЧтениеXML.Значение));
				ОсновнойРаздел.Вставить("НомерДляПоиска", НомерДляПоиска);
				Номер = СтрЗаменить(НомерДляПоиска, "/", "");
			КонецЕсли;	
				
		КонецЕсли;	
		
	КонецЦикла;	 
	
	ТаблицаАртикулов.Свернуть("Артикул, НомерРаздела");
	
	Груз = смарт_НайтиГрузПоНомеруДекларации(ОсновнойРаздел.Получить("НомерДляПоиска"), СтрокаОшибки);
	
	Если Груз = Неопределено Тогда 
		Возврат;
	Иначе
		ОсновнойРаздел.Вставить("Груз", Груз);
	КонецЕсли;
	
	Склад = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Груз, "СкладПолучатель");
	
	Если ЗначениеЗаполнено(Склад) Тогда 
		
		Для Каждого СтрокаТаблицыРазделов Из РазделыГТД Цикл 		
			СтрокаТаблицыРазделов.Склад = Склад;
		КонецЦикла;	
		
	КонецЕсли;	
	
	ОсновнойРаздел.Вставить("Статус", Перечисления.СтатусыТаможенныхДеклараций.ВыпущеноСТаможни);
	ОсновнойРаздел.Вставить("Валюта", Справочники.Валюты.НайтиПоКоду("643"));
	ОсновнойРаздел.Вставить("Комментарий", ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Груз, "Наименование"));
	
	РазделРасчеты.Вставить("ВариантОформления", Перечисления.ХозяйственныеОперации.ОформлениеГТДСамостоятельно);
	КонтрагентТаможни = Справочники.Контрагенты.НайтиПоРеквизиту("ИНН", "7730176610");
	
	Если КонтрагентТаможни <> Справочники.Контрагенты.ПустаяСсылка() Тогда 
		РазделРасчеты.Вставить("Контрагент", КонтрагентТаможни);
		Партнер = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(КонтрагентТаможни, "Партнер");
		
		Если ЗначениеЗаполнено(Партнер) Тогда 
			РазделРасчеты.Вставить("Партнер", Партнер);
		КонецЕсли;
		
		Договор = смарт_ПолучитьДействующийДоговорКонтрагента(КонтрагентТаможни);
		
		Если Договор <> Неопределено Тогда 
			РазделРасчеты.Вставить("Договор", Договор);
		КонецЕсли;
		
	Иначе
		
		РазделРасчеты.Вставить("Контрагент", Неопределено);
		РазделРасчеты.Вставить("Партнер", Неопределено);
		РазделРасчеты.Вставить("Договор", Неопределено);
		
	КонецЕсли;
	
	РазделРасчеты.Вставить("СтатьяРасходовСбор", ПланыВидовХарактеристик.СтатьиРасходов.НайтиПоКоду("ЦБ-000183"));
	
	Для Каждого ТекРеквизит Из Объект.Ссылка.Метаданные().Реквизиты Цикл 
		
		РеквизитОсновногоРаздела = ОсновнойРаздел.Получить(ТекРеквизит.Имя);
		РеквизитРазделаРасчеты = РазделРасчеты.Получить(ТекРеквизит.Имя);
		Если РеквизитОсновногоРаздела <> Неопределено Тогда 
			Объект[ТекРеквизит.Имя] = РеквизитОсновногоРаздела;
		ИначеЕсли РеквизитРазделаРасчеты <> Неопределено Тогда 
			Объект[ТекРеквизит.Имя] = РеквизитРазделаРасчеты;
		Иначе
			Объект[ТекРеквизит.Имя] = Неопределено;			
		КонецЕсли;
		
	КонецЦикла;	
	
	Объект.Дата = ОсновнойРаздел.Получить("Дата");
	Объект.НомерДекларации = Номер;
	Объект.ДатаПлатежа = ОсновнойРаздел.Получить("Дата");
	Объект.ПорядокРасчетов = Перечисления.ПорядокРасчетов.ПоДоговорамКонтрагентов;
	Объект.ВалютаВзаиморасчетов = ОсновнойРаздел.Получить("Валюта");
	ТекущийПользователь = ПользователиКлиентСервер.ТекущийПользователь();
		
	Если ЗначениеЗаполнено(ТекущийПользователь) Тогда 
		Объект.Менеджер = ТекущийПользователь;
		Объект.Подразделение = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТекущийПользователь, "Подразделение");
	КонецЕсли;
	
	Объект.ПорядокОплаты = Перечисления.ПорядокОплатыПоСоглашениям.РасчетыВРубляхОплатаВРублях;
	Объект.ФормаОплаты = Перечисления.ФормыОплаты.Безналичная;
	
	
	ЗаполнитьПоГрузуНаСервере();
	КоличествоРазделовПоГрузу = Объект.Разделы.Количество();
	
	Если КоличествоРазделовПоГрузу > 1 Тогда 
		
		Индекс = КоличествоРазделовПоГрузу - 1;
	
		Пока Индекс > 0 Цикл    
			Объект.Разделы.Удалить(Индекс);
			Индекс = Индекс - 1;
		КонецЦикла;
			
	КонецЕсли;
	
	Объект.Разделы[0].НомерРаздела = 999;
	
	МассивСтрокНаУдаление = Новый Массив;
	
	Контрагент = Неопределено;
	
	
	
	 //++ смарт:ЩукинВВ #0-000033073 623 02.11.2021
	
	
	

	
	Для Каждого СтрокаТоваров Из Объект.Товары Цикл
		СтрокаТоваров.НомерРаздела = 999;
		
				Если Не ЗначениеЗаполнено(Контрагент) И ЗначениеЗаполнено(СтрокаТоваров.ДокументПоступления) И ЗначениеЗаполнено(СтрокаТоваров.ДокументПоступления.Контрагент) Тогда
			Контрагент = СтрокаТоваров.ДокументПоступления.Партнер;
			Объект.Поставщик = Контрагент.Ссылка;
			ПартнерыИКонтрагенты.ЗаполнитьКонтрагентаПартнераПоУмолчанию(Объект.Поставщик, Объект.КонтрагентПоставщика);
		КонецЕсли;
			
		Если ЗначениеЗаполнено(СтрокаТоваров.Номенклатура) Тогда 			
			АртикулБазы = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаТоваров.Номенклатура, "Артикул");
			
			
			СтрокаТоваров.Артикул = ВРег(АртикулБазы); 
			
			Для Каждого СтрокаАртикулов Из ТаблицаАртикулов Цикл				
				СтрокаНайдена = 0 <> СтрНайти(СтрокаТоваров.Артикул, ВРег(СтрокаАртикулов.Артикул));
				
				Если СтрокаНайдена Тогда
					СтрокаТоваров.НомерРаздела = СтрокаАртикулов.НомерРаздела;
					Прервать;
				КонецЕсли;	
				
								
				
				СтрокаНайдена = 0 <> СтрНайти(ВРег(СтрокаАртикулов.Артикул),СтрокаТоваров.Артикул);
				
				Если СтрокаНайдена Тогда
					СтрокаТоваров.НомерРаздела = СтрокаАртикулов.НомерРаздела;
					Прервать;
				КонецЕсли;	
				
				
				
			КонецЦикла;
			
			Если ЗначениеЗаполнено(СтрокаТоваров.ДокументПоступления) Тогда 
				Стоимость = смарт_ПолучитьСтоимостьНоменклатуры(СтрокаТоваров.Номенклатура, СтрокаТоваров.ДокументПоступления);
				СтрокаТоваров.ТаможеннаяСтоимость = СтрокаТоваров.КоличествоУпаковок * Стоимость;
			КонецЕсли;	
			
		КонецЕсли;
		
		СтрокаТоваров.ПорядковыйНомерТовара = СтрокаТоваров.НомерРаздела;
		
	КонецЦикла;
	
	 //-- смарт:ЩукинВВ #0-000033073 623 02.11.2021

	
	
	Для Каждого СтрокаРазделыГТД Из РазделыГТД Цикл 
		
		НоваяСтрокаРазделы = Объект.Разделы.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрокаРазделы, СтрокаРазделыГТД);
		
	КонецЦикла;
	
	ПараметрыПоиска = Новый Структура;
	ПараметрыПоиска.Вставить("НомерРаздела", 999);
	НераспределенныеСтроки = Объект.Товары.НайтиСтроки(ПараметрыПоиска);
	
	Если НераспределенныеСтроки.Количество() > 0 Тогда 
		СтрокаОшибки = "Имеются нераспределенные строки. Информация по ним содержится в разделе с номеро 999";	
	Иначе
		Объект.Разделы.Удалить(0);
	КонецЕсли;	
	
	ОбновитьИнформациюПоПоступлениям();
	
КонецПроцедуры

&НаСервере
Функция смарт_ПолучитьСтоимостьНоменклатуры(Номенклатура, ДокументПоступления)
	
	//++ смарт:ЩукинВВ #27806 623 17.09.2021
	ПараметрыПоиска = Новый Структура;
	ПараметрыПоиска.Вставить("Номенклатура", Номенклатура);
	МассивСтрокТоваров = ДокументПоступления.Товары.НайтиСтроки(ПараметрыПоиска);
	Если МассивСтрокТоваров.Количество() > 0 Тогда 
		
		Для Каждого СтрокаТоваров Из МассивСтрокТоваров Цикл 
			
			Если СтрокаТоваров.Цена <> 0 Тогда 
				Возврат СтрокаТоваров.Цена;
			КонецЕсли;
			
		КонецЦикла;	
		
	КонецЕсли;
	
	Возврат 0;
	//-- смарт:ЩукинВВ #27806 623 17.09.2021
	
КонецФункции	

&НаКлиенте
Процедура смарт_ПолучитьПутьКФайлу(ПутьКфайлу)
	//++ смарт:ЩукинВВ #27806 623 17.09.2021
	Диалог = новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	Диалог.Фильтр = "Текстовый документ, *.xml|*.xml";
	Диалог.МножественныйВыбор=Ложь;
	Если Диалог.Выбрать() Тогда
		ПутьКФайлу = Диалог.ПолноеИмяФайла;
		//Полный путь к файлу помещен в переменную ИмяФайла
	КонецЕсли;
	//-- смарт:ЩукинВВ #27806 623 17.09.2021
КонецПроцедуры

&НаКлиенте
Процедура смарт_ЗаполнитьПоXMLПосле(Команда)
	//++ смарт:ЩукинВВ #27806 623 17.09.2021
	Если Объект.Товары.Количество() Тогда
		ТекстВопроса="Табличные части будут очищены!
		|Продолжить?";
		ПоказатьВопрос(Новый ОписаниеОповещения("смарт_ПослеВопросаЗагрузитьПоXML",ЭтотОбъект),ТекстВопроса,РежимДиалогаВопрос.ДаНет);
	Иначе 
		ПутьКфайлу = "";
		смарт_ПолучитьПутьКФайлу(ПутьКфайлу);
		
		Если ПутьКфайлу <> "" Тогда
			СтрокаОшибки = "";
			смарт_ЗаполнитьПоXMLПослеНаСервере(Новый ДвоичныеДанные(ПутьКФайлу), СтрокаОшибки);
			
			Если СтрокаОшибки <> "" Тогда
				ПоказатьВопрос(Новый ОписаниеОповещения("смарт_ПослеВопросаЗагрузитьПоXML",ЭтотОбъект),СтрокаОшибки,РежимДиалогаВопрос.ОК);
			Иначе	
				смарт_РаспределитьТаможеннуюСтоимость(Ложь);
			КонецЕсли;
			
		Иначе
			ПоказатьВопрос(Новый ОписаниеОповещения("смарт_ПослеВопросаЗагрузитьПоXML",ЭтотОбъект),"Необходимо выбрать файл с данными.",РежимДиалогаВопрос.ОК);
		КонецЕсли;	
		
	КонецЕсли;	
	//-- смарт:ЩукинВВ #27806 623 17.09.2021
КонецПроцедуры
	
&НаКлиенте
Процедура смарт_ПослеВопросаЗагрузитьПоXML(Рез,ДопПараметры)Экспорт 
	//++ смарт:ЩукинВВ #27806 623 17.09.2021
	Если Рез=КодВозвратаДиалога.Да Тогда 
		ПутьКфайлу = "";
		смарт_ПолучитьПутьКФайлу(ПутьКфайлу);
		
		Если ПутьКфайлу <> "" Тогда
			СтрокаОшибки = "";
			смарт_ЗаполнитьПоXMLПослеНаСервере(Новый ДвоичныеДанные(ПутьКФайлу), СтрокаОшибки);
			
			Если СтрокаОшибки <> "" Тогда 
				ПоказатьВопрос(Новый ОписаниеОповещения("смарт_ПослеВопросаЗагрузитьПоXML",ЭтотОбъект),СтрокаОшибки,РежимДиалогаВопрос.ОК);
			Иначе	
				смарт_РаспределитьТаможеннуюСтоимость(Ложь);
			КонецЕсли;
			
		Иначе
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Необходимо выбрать файл с данными.");
		КонецЕсли;
		
	КонецЕсли;	
	//-- смарт:ЩукинВВ #27806 623 17.09.2021
КонецПроцедуры	

&НаСервере
Функция смарт_ПолучитьСтавкуНДС_ПеречислениемСсылка(СтавкаНДС_Числом)
	//++ смарт:ЩукинВВ #27806 623 17.09.2021
	Если СтавкаНДС_Числом = 20 Тогда
		Возврат Перечисления.СтавкиНДС.НДС20;
	ИначеЕсли СтавкаНДС_Числом = 10 Тогда
		Возврат Перечисления.СтавкиНДС.НДС10;
	ИначеЕсли СтавкаНДС_Числом = 18 Тогда
		Возврат Перечисления.СтавкиНДС.НДС18;
	КонецЕсли;
	
	Возврат Перечисления.СтавкиНДС.БезНДС;
	//-- смарт:ЩукинВВ #27806 623 17.09.2021
КонецФункции	

&НаСервере
Процедура смарт_ЗаполнитьРазделыГТД(НомерРазделаГТД, Колонка, Значение, РазделыГТД)
	//++ смарт:ЩукинВВ #27806 623 17.09.2021
	СтруктураПоиска = Новый Структура("НомерРаздела", НомерРазделаГТД);
	МассивНайденныхСтрок = РазделыГТД.НайтиСтроки(СтруктураПоиска);
	
	Если МассивНайденныхСтрок.Количество() > 0 Тогда 
		МассивНайденныхСтрок[0][Колонка] = Значение;
	Иначе
		НоваяСтрока = РазделыГТД.Добавить();
		НоваяСтрока[Колонка] = Значение;
	КонецЕсли;	
	//-- смарт:ЩукинВВ #27806 623 17.09.2021
КонецПроцедуры	

&НаСервере
Функция смарт_ПолучитьДействующийДоговорКонтрагента(КонтрагентТаможни)
	//++ смарт:ЩукинВВ #27806 623 17.09.2021
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ДоговорыКонтрагентов.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|ГДЕ
	|	ДоговорыКонтрагентов.Контрагент = &Контрагент
	|	И ДоговорыКонтрагентов.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыДоговоровКонтрагентов.Действует)";
	
	Запрос.УстановитьПараметр("Контрагент", КонтрагентТаможни);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат ВыборкаДетальныеЗаписи.Ссылка;
	КонецЦикла;
	
	Возврат Неопределено
	//-- смарт:ЩукинВВ #27806 623 17.09.2021
КонецФункции	

&НаСервере
Функция смарт_ПолучитьКонтрагента(Наименование)
	
	//++ смарт:ЩукинВВ #27806 623 17.09.2021
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Контрагенты.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Контрагенты КАК Контрагенты
	|ГДЕ
	|	Контрагенты.Наименование = &Наименование";
	
	Запрос.УстановитьПараметр("Наименование", Наименование);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Количество() = 0 Или ВыборкаДетальныеЗаписи.Количество() > 1 Тогда 
		
		Возврат Справочники.Контрагенты.ПустаяСсылка();
		
	Иначе
		
		Возврат ВыборкаДетальныеЗаписи.Ссылка;
		
	КонецЕсли;	
	//-- смарт:ЩукинВВ #27806 623 17.09.2021
КонецФункции

&НаСервере
Функция смарт_НайтиГрузПоНомеруДекларации(НомерДекларации, СтрокаОшибки);
	//++ смарт:ЩукинВВ #27806 623 17.09.2021
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Грузы.Ссылка КАК Ссылка
	|ИЗ
	//++#1374 смарт: Балашов 14.06.2023 //Разработать учет закупок в разрезе Контейнеров    
	|	Справочник.смартГрузы КАК Грузы
	//--#1374 смарт: Балашов 14.06.2023
	|ГДЕ
	|	Грузы.смарт_НомерТаможеннойДекларации = &смарт_НомерТаможеннойДекларации";
	
	Запрос.УстановитьПараметр("смарт_НомерТаможеннойДекларации", НомерДекларации);
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	Если РезультатЗапроса.Количество() > 1 Тогда
		СтрокаОшибки = "Найдено более одного груза по № декларации. Приведите груз в нормативное состояние или создайте декларацию вручную";
		Возврат Неопределено;
	ИначеЕсли РезультатЗапроса.Количество() = 0 Тогда
		СтрокаОшибки = "Груз по № декларации не найден.";
		Возврат Неопределено;
	Иначе
		Возврат РезультатЗапроса[0].Ссылка;
	КонецЕсли;	
	//-- смарт:ЩукинВВ #27806 623 17.09.2021
	
КонецФункции	

&НаСервере
Функция смарт_ПолучитьЗначениеСоответствия(Соответствие, ПутьКСтроке)
	//++ смарт:ЩукинВВ #27806 623 17.09.2021
	Если СтрНайти(ПутьКСтроке, "GTDID") <> 0 Тогда 
		Ключ = "НомерДляПоиска";
	КонецЕсли;
	
	Возврат Соответствие.Получить(Ключ);
	//-- смарт:ЩукинВВ #27806 623 17.09.2021
КонецФункции	

&НаСервере
Функция смарт_ПостроитьПуть(СтекИмен)
	//++ смарт:ЩукинВВ #27806 623 17.09.2021
	Путь = "";
	
	Для Каждого Имя Из СтекИмен Цикл
		Путь = Путь + "/" + Имя;
	КонецЦикла;
	
	Возврат Путь;
	//-- смарт:ЩукинВВ #27806 623 17.09.2021
КонецФункции

&НаСервере
Процедура смарт_РаспределитьНаТоварыПоСуммеПослеНаСервере()
	//++ смарт:ЩукинВВ #27806 623 17.09.2021
	Отбор = Новый Структура("НомерРаздела");
	Разделы = ОбщегоНазначенияУТКлиентСервер.ВыделенныеЭлементыКоллекции(Объект.Разделы, Элементы.Разделы.ВыделенныеСтроки);
	СписокРазделов = "";
	Для Каждого Раздел Из Разделы Цикл
		НомерРаздела = Формат(Раздел.НомерРаздела, "ЧН=0; ЧГ=0");
		СписокРазделов = СписокРазделов + ?(ЗначениеЗаполнено(СписокРазделов), ", ", "") + НомерРаздела;
		
		Если Раздел.ТаможеннаяСтоимость = 0. Тогда
			ТекстОшибки = НСтр("ru='Необходимо задать таможенную стоимость в разделе %НомерРаздела%.'");
			ТекстОшибки = СтрЗаменить(ТекстОшибки, "%НомерРаздела%", НомерРаздела);
			ПолеСтоимости = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("Разделы", Раздел.НомерСтроки, "ТаможеннаяСтоимость");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки, Объект.Ссылка, ПолеСтоимости, "Объект");
		КонецЕсли;
		
		Отбор.НомерРаздела = Раздел.НомерРаздела;
		Товары = Объект.Товары.НайтиСтроки(Отбор);
		Для Каждого СтрокаТоваров Из Товары Цикл
			
			Если ЗначениеЗаполнено(СтрокаТоваров.Номенклатура) Тогда 			
				
				Если ЗначениеЗаполнено(СтрокаТоваров.ДокументПоступления) Тогда 
					Стоимость = смарт_ПолучитьСтоимостьНоменклатуры(СтрокаТоваров.Номенклатура, СтрокаТоваров.ДокументПоступления);
					СтрокаТоваров.ТаможеннаяСтоимость = СтрокаТоваров.КоличествоУпаковок * Стоимость;
				КонецЕсли;	
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;	
	//-- смарт:ЩукинВВ #27806 623 17.09.2021	
КонецПроцедуры

&НаКлиенте
Процедура смарт_РаспределитьТаможеннуюСтоимость(ОтборПоРазделам)
	//++ смарт:ЩукинВВ #27806 623 17.09.2021
	ОчиститьСообщения();
	
	ТекстОшибки = "";
	Если Объект.Разделы.Количество() = 0 Тогда
		ТекстОшибки = НСтр("ru='Необходимо создать хотя бы один раздел декларации и заполнить в нем товары.'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки, Объект.Ссылка, "Объект.Разделы");
		Возврат;
	КонецЕсли;
	Если Объект.Товары.Количество() = 0 Тогда
		ТекстОшибки = НСтр("ru='Необходимо заполнить товары декларации. Это можно сделать с помощью команды ""Заполнить"" или вручную.'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки, Объект.Ссылка, "Объект.Товары");
		Возврат;
	КонецЕсли;
	
	Отбор = Новый Структура("НомерРаздела");
	Если ОтборПоРазделам Тогда 
		Разделы = ОбщегоНазначенияУТКлиентСервер.ВыделенныеЭлементыКоллекции(Объект.Разделы, Элементы.Разделы.ВыделенныеСтроки);
	ИначеЕсли Не ОтборПоРазделам Тогда 
		Разделы = Объект.Разделы;
	КонецЕсли;	
	СписокРазделов = "";
	Для Каждого Раздел Из Разделы Цикл
		НомерРаздела = Формат(Раздел.НомерРаздела, "ЧН=0; ЧГ=0");
		СписокРазделов = СписокРазделов + ?(ЗначениеЗаполнено(СписокРазделов), ", ", "") + НомерРаздела;
		
		Если Раздел.ТаможеннаяСтоимость = 0. Тогда
			ТекстОшибки = НСтр("ru='Необходимо задать таможенную стоимость в разделе %НомерРаздела%.'");
			ТекстОшибки = СтрЗаменить(ТекстОшибки, "%НомерРаздела%", НомерРаздела);
			ПолеСтоимости = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("Разделы", Раздел.НомерСтроки, "ТаможеннаяСтоимость");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки, Объект.Ссылка, ПолеСтоимости, "Объект");
		КонецЕсли;
		
		Отбор.НомерРаздела = Раздел.НомерРаздела;
		Товары = Объект.Товары.НайтиСтроки(Отбор);
		Для Каждого Товар Из Товары Цикл
			Если Товар.ТаможеннаяСтоимость = 0. Тогда
				ТекстОшибки =
				НСтр("ru='Необходимо предварительно заполнить таможенную стоимость товара в строке %СтрокаТовара% раздела %НомерРаздела%.'");
				ТекстОшибки = СтрЗаменить(ТекстОшибки, "%НомерРаздела%", НомерРаздела);
				ТекстОшибки = СтрЗаменить(ТекстОшибки, "%СтрокаТовара%", Формат(Товар.НомерСтроки, "ЧН=0; ЧГ=0"));
				ПолеСтоимости = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("Товары", Товар.НомерСтроки, "ТаможеннаяСтоимость");
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки, Объект.Ссылка, ПолеСтоимости, "Объект");
			КонецЕсли;
		КонецЦикла;
		Если Товары.Количество() = 0 Тогда
			ТекстОшибки = НСтр("ru='Необходимо заполнить товары раздела %НомерРаздела%. Это можно сделать с помощью команды ""Заполнить"" или вручную.'");
			ТекстОшибки = СтрЗаменить(ТекстОшибки, "%НомерРаздела%", НомерРаздела);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки, Объект.Ссылка, "Объект.Товары");
		КонецЕсли;
	КонецЦикла;
	
	Если ТекстОшибки <> "" Или Разделы.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	смарт_РаспределитьНаТоварыСервер_АК(ОтборПоРазделам);
	
	ТекстПояснения = ?(Разделы.Количество() > 1,
	НСтр("ru = 'Суммы разделов %СписокРазделов% распределены на товары'"),
	НСтр("ru = 'Суммы раздела %СписокРазделов% распределены на товары'"));
	ПоказатьОповещениеПользователя(
	НСтр("ru = 'Команда выполнена'"), ,
	СтрЗаменить(ТекстПояснения, "%СписокРазделов%", СписокРазделов), БиблиотекаКартинок.Информация32);	
	//-- смарт:ЩукинВВ #27806 623 17.09.2021
КонецПроцедуры	

&НаСервере
Процедура смарт_РаспределитьНаТоварыСервер_АК(ОтборПоРазделам)
	//++ смарт:ЩукинВВ #27806 623 17.09.2021
	Отбор = Новый Структура("НомерРаздела");
	Если ОтборПоРазделам Тогда 
		Разделы = ОбщегоНазначенияУТКлиентСервер.ВыделенныеЭлементыКоллекции(Объект.Разделы, Элементы.Разделы.ВыделенныеСтроки);
	ИначеЕсли Не ОтборПоРазделам Тогда 
		Разделы = Объект.Разделы;
	КонецЕсли;
	Для Каждого Раздел Из Разделы Цикл
		Отбор.НомерРаздела = Раздел.НомерРаздела;
		ТоварыРаздела = Объект.Товары.Выгрузить(Отбор);
		
		Если ТоварыРаздела.Количество() > 0 Тогда
			Коэффициенты = ТоварыРаздела.ВыгрузитьКолонку("ТаможеннаяСтоимость");
			НовыеСуммы = ОбщегоНазначения.РаспределитьСуммуПропорциональноКоэффициентам(Раздел.ТаможеннаяСтоимость, Коэффициенты);
			Если НовыеСуммы <> Неопределено Тогда
				ТоварыРаздела.ЗагрузитьКолонку(НовыеСуммы, "ТаможеннаяСтоимость");
			КонецЕсли;
			НовыеСуммы = ОбщегоНазначения.РаспределитьСуммуПропорциональноКоэффициентам(Раздел.СуммаПошлины, Коэффициенты);
			Если НовыеСуммы <> Неопределено Тогда
				ТоварыРаздела.ЗагрузитьКолонку(НовыеСуммы, "СуммаПошлины");
			КонецЕсли;
			НовыеСуммы = ОбщегоНазначения.РаспределитьСуммуПропорциональноКоэффициентам(Раздел.СуммаНДС, Коэффициенты);
			Если НовыеСуммы <> Неопределено Тогда
				ТоварыРаздела.ЗагрузитьКолонку(НовыеСуммы, "СуммаНДС");
			КонецЕсли;
		КонецЕсли;
		
		Для каждого Товар Из ТоварыРаздела Цикл
			ОбъектТовар = Объект.Товары[Товар.НомерСтроки-1];
			Объект.Товары[Товар.НомерСтроки-1].ТаможеннаяСтоимость = ?(Раздел.ТаможеннаяСтоимость > 0., Товар.ТаможеннаяСтоимость, 0.);
			Объект.Товары[Товар.НомерСтроки-1].СуммаПошлины = ?(Раздел.СуммаПошлины > 0., Товар.СуммаПошлины, 0.);
			Объект.Товары[Товар.НомерСтроки-1].СуммаНДС = ?(Раздел.СуммаНДС > 0., Товар.СуммаНДС, 0.);
			//++ смарт:ММ #042 222 27.03.2020 Рефакторинг. Перенесено из расширения (отмена &Вместо) 
			// Фролов+
			Объект.Товары[Товар.НомерСтроки-1].СтранаПроисхождения=Раздел.СтранаПроисхождения;
			// Фролов-
			//-- смарт:ММ 27.03.2020
		КонецЦикла;
	КонецЦикла;
		
	ЗаполнитьЗначенияСвойств(ЭтаФорма, РазностиИтогов(Объект.Разделы, Объект.Товары));
	//++ смарт:ЩукинВВ #27806 623 17.09.2021
КонецПроцедуры

&НаКлиенте
Процедура смарт_РаспределитьНаТоварыПоСуммеПосле(Команда)
	//++ смарт:ЩукинВВ #27806 623 17.09.2021
	смарт_РаспределитьНаТоварыПоСуммеПослеНаСервере();
	смарт_РаспределитьТаможеннуюСтоимость(Истина);
	//-- смарт:ЩукинВВ #27806 623 17.09.2021
КонецПроцедуры

&НаСервере
&ИзменениеИКонтроль("ОбновитьИнформациюПоПоступлениям")
Процедура смарт_ОбновитьИнформациюПоПоступлениям()

	СписокПоступлений.Очистить();
	Для Каждого ТекСтрока Из Объект.Товары Цикл
		Если ЗначениеЗаполнено(ТекСтрока.ДокументПоступления) И СписокПоступлений.НайтиПоЗначению(ТекСтрока.ДокументПоступления) = Неопределено Тогда
			СписокПоступлений.Добавить(ТекСтрока.ДокументПоступления);
		КонецЕсли;
	КонецЦикла;

	Если СписокПоступлений.Количество() = 1 Тогда
		ПоступлениеТоваров = СписокПоступлений[0].Значение;
	КонецЕсли;

	Если СписокПоступлений.Количество() > 1 Тогда
		НадписьЗаголовокПоступления = СтрЗаменить(
		НСтр("ru='Всего документов: %КоличествоПоступлений%'"), 
		"%КоличествоПоступлений%",
		СписокПоступлений.Количество());
		ПоступлениеТоваров = Неопределено;
	КонецЕсли;

	Если СписокПоступлений.Количество() < 1 Тогда
		ПоступлениеТоваров = Неопределено;
	КонецЕсли;

	Если СписокПоступлений.Количество() <= 1 Тогда
		Элементы.СтраницыПоступления.ТекущаяСтраница = Элементы.СтраницаПоступление;
	Иначе
		Элементы.СтраницыПоступления.ТекущаяСтраница = Элементы.СтраницаПоступления;
	КонецЕсли;
	
	#Вставка
	//++ #Б1598 смарт: Шляпников 09.12.2024 / Раздельный учет товаров. Гарантийные запчасти. Дополнение.
	РезультирующийФлаг = Ложь;
	ЗначенияФлаговОснований = ОбщегоНазначения.ЗначенияРеквизитовОбъектов(СписокПоступлений.ВыгрузитьЗначения(), "смартЗапчастиГарантийные");
	
	Для каждого стрПоступление Из ЗначенияФлаговОснований Цикл
		РезультирующийФлаг = РезультирующийФлаг ИЛИ стрПоступление.Значение.смартЗапчастиГарантийные;
	КонецЦикла;
	
	Если РезультирующийФлаг <> Объект.смартЗапчастиГарантийные Тогда
		Объект.смартЗапчастиГарантийные = РезультирующийФлаг;
		ЭтаФорма.Модифицированность = Истина;
	КонецЕсли;
	//-- #Б1598 смарт: Шляпников 09.12.2024
	#КонецВставки

КонецПроцедуры

&НаСервере
&ИзменениеИКонтроль("ПередЗаписьюНаСервере")
Процедура смарт_ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	// Обработчик механизма "Свойства"
	УправлениеСвойствами.ПередЗаписьюНаСервере(ЭтаФорма, ТекущийОбъект);

	МодификацияКонфигурацииПереопределяемый.ПередЗаписьюНаСервере(ЭтаФорма, Отказ, ТекущийОбъект, ПараметрыЗаписи);

	// ИнтеграцияС1СДокументооборотом
	ИнтеграцияС1СДокументооборот.ПередЗаписьюНаСервере(ЭтаФорма, ТекущийОбъект, ПараметрыЗаписи);
	// Конец ИнтеграцияС1СДокументооборотом

	#Вставка
	//++ #Б1598 смарт: Шляпников 09.12.2024 / Раздельный учет товаров. Гарантийные запчасти. Дополнение.
	ЗначенияФлаговОснований = ОбщегоНазначения.ЗначенияРеквизитовОбъектов(СписокПоступлений.ВыгрузитьЗначения(), "смартЗапчастиГарантийные");
	
	Для каждого стрПоступление Из ЗначенияФлаговОснований Цикл
		Если стрПоступление.Значение.смартЗапчастиГарантийные <> Объект.смартЗапчастиГарантийные Тогда
			ОбщегоНазначения.СообщитьПользователю(СтрШаблон("Несоответствие типов признака Запчасти гарантийные (смарт) в документе %1",
															стрПоступление.Ключ), , , , Отказ);
		КонецЕсли;
	КонецЦикла;
	//-- #Б1598 смарт: Шляпников 09.12.2024
	#КонецВставки
	
КонецПроцедуры

#КонецОбласти
